In [6]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "메뉴" : ['아메리카노', '카페라떼', '에스프레소', '카페모카', '바닐라라떼'],
    "가격" : [4500, 5000, 4000, 5900, 5300],
    "칼로리" :[10,110, np.NaN, 210, np.NaN],
    "원산지" : ['과테말라', '브라질', '과테말라', np.NaN, np.NaN]
})
df

      메뉴    가격    칼로리   원산지
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000    NaN  과테말라
3   카페모카  5900  210.0   NaN
4  바닐라라떼  5300    NaN   NaN

## Q1. '칼로리' 칼럼의 결측치를 칼로리 데이터 중 최솟값으로 채우시오.

In [7]:
df['칼로리'] = df['칼로리'].fillna(min(df['칼로리']))
df

      메뉴    가격    칼로리   원산지
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000   10.0  과테말라
3   카페모카  5900  210.0   NaN
4  바닐라라떼  5300   10.0   NaN

## Q2. ‘원산지’ 칼럼의 결측치를 원산지 데이터 중 최빈값으로 채우시오.

In [8]:
df['원산지'] = df['원산지'].fillna(df['원산지'].mode()[0])
df

      메뉴    가격    칼로리   원산지
0  아메리카노  4500   10.0  과테말라
1   카페라떼  5000  110.0   브라질
2  에스프레소  4000   10.0  과테말라
3   카페모카  5900  210.0  과테말라
4  바닐라라떼  5300   10.0  과테말라

## Q3. 가격이 5000 이상인 데이터의 수를 구하시오.

In [11]:
len(df[df['가격'] >= 5000])

3

## Q4. '이벤트가' 칼럼을 만들고 기존 가격에서 50% 할인된 가격을 채우시오.

In [13]:
df['이벤트가'] = df['가격'] * 0.5
df

      메뉴    가격    칼로리   원산지    이벤트가
0  아메리카노  4500   10.0  과테말라  2250.0
1   카페라떼  5000  110.0   브라질  2500.0
2  에스프레소  4000   10.0  과테말라  2000.0
3   카페모카  5900  210.0  과테말라  2950.0
4  바닐라라떼  5300   10.0  과테말라  2650.0

## Q5. '칼로리' 칼럼을 삭제하시오.

In [19]:
df = df.drop('칼로리', axis=1)
df

      메뉴    가격   원산지    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0
3   카페모카  5900  과테말라  2950.0
4  바닐라라떼  5300  과테말라  2650.0

## Q6. 위에서부터 3개의 행만 선택하시오.(loc 사용)

In [20]:
df.loc[:2]

      메뉴    가격   원산지    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0

## Q7. 위에서부터 3개의 행만 선택하시오.(iloc 사용)

In [21]:
df.iloc[:3]

      메뉴    가격   원산지    이벤트가
0  아메리카노  4500  과테말라  2250.0
1   카페라떼  5000   브라질  2500.0
2  에스프레소  4000  과테말라  2000.0

## Q8. 주어진 데이터(df)에서 아래 값을 loc를 활용해 데이터프레임으로 출력하시오.

### * 카페라떼 5000, * 에스프레소 4000

In [26]:
df.loc[1:2][['메뉴', '가격']]

      메뉴    가격
1   카페라떼  5000
2  에스프레소  4000

In [27]:
df.loc[1:2, :'가격']

      메뉴    가격
1   카페라떼  5000
2  에스프레소  4000

## Q9. 주어진 데이터(df)에서 아래 값을 iloc를 활용해 데이터프레임으로 출력하시오.

### * 카페라떼 5000, * 에스프레소 4000

In [44]:
df.iloc[1:3,:2]

      메뉴    가격
1   카페라떼  5000
2  에스프레소  4000

## Q10. 메뉴 중 가격이 가장 비싼 순으로 정렬해 상위 3개의 값을 구하시오.

In [49]:
sort_df = df.sort_values('가격', ascending = False)
sort_df.iloc[:3]

      메뉴    가격   원산지    이벤트가
3   카페모카  5900  과테말라  2950.0
4  바닐라라떼  5300  과테말라  2650.0
1   카페라떼  5000   브라질  2500.0